# Taps
tap "aws/tap"
tap "fluxcd/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "matsuyoshi30/gitsu"
# Core Packages
brew "chezmoi"
brew "htop"
brew "nmap"
brew "starship"
brew "wget"
brew "pkg-config" # needed for python package builds
brew "fish"
brew "wget"
brew "aws-vault"
# DevOps Packages
brew "age"
brew "fluxcd/tap/flux"
brew "helm"
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"
brew "terraform"
brew "sops"
brew "rancher-cli"
brew "docker-compose"
# Code Packages
brew "hugo"
brew "go"
brew "node"
brew "pipenv"
brew "golangci-lint"
brew "python@3.9"
brew "python@3.10"
brew "zsh"
brew "neovim"
brew "git"
brew "awscli"
# Casks
cask "alfred"
cask "docker"
cask "iterm2"
cask "powershell"
cask "spotify"
cask "visual-studio-code"
cask "brave-browser"
cask "discord"
cask "microsoft-office"
cask "microsoft-teams"
cask "obsidian"
cask "spotify"
cask "stats"
cask "royal-tsx"
cask "fork"
cask "slack"
cask "font-fira-code-nerd-font" # fonts?
brew "matsuyoshi30/gitsu/gitsu" # git user management
