# Brewfile — managed by chezmoi
# Generated from `home/.chezmoidata/brew/*.yaml` overlays.
# Do not edit this file directly; edit the overlay YAML data.
# Template input hashes (make template/data changes visible in output):
# - Brewfile.tmpl: 9da3b3cdf820540211b5ef293d2fa95ec1e20e3ffb5893b19c87df74aef7290f
# - brew overlays: 89cee54c2e3fc29571a654c5ca645326fae4f5f6fb8cc883618ad8f6fcd9d05d
#
# Model:
# - package objects include type/name plus structured conditions.
# - all overlays in `.chezmoidata/brew/*.yaml` are rendered.
#
# - This file is evaluated as Ruby; use OS.mac? / OS.linux? for platform-specific entries.
# - Do NOT regenerate this file wholesale from `brew bundle dump`.
# - Commented-out lines are intentionally excluded (broken, unwanted, or deferred).
tap "anomalyco/tap" unless ENV["HOMEBREW_CODESPACES"]
brew "anomalyco/tap/opencode" unless ENV["HOMEBREW_CODESPACES"]
brew "antidote"
brew "asitop" if OS.mac?
brew "aws-vault" unless ENV["HOMEBREW_CODESPACES"]
brew "awscli" unless ENV["HOMEBREW_CODESPACES"]
brew "bash" unless ENV["HOMEBREW_CODESPACES"]
brew "bat"
brew "bitwarden-cli" unless ENV["HOMEBREW_CODESPACES"]
brew "blueutil" if OS.mac?
brew "btop" unless ENV["HOMEBREW_CODESPACES"]
brew "cbonsai" if (ENV["HOMEBREW_PRIVATE"]) && !(ENV["HOMEBREW_CODESPACES"])
brew "chezmoi"
brew "colima" unless ENV["HOMEBREW_CODESPACES"]
brew "colordiff" unless ENV["HOMEBREW_CODESPACES"]
brew "docker" unless ENV["HOMEBREW_CODESPACES"]
brew "docker-compose" unless ENV["HOMEBREW_CODESPACES"]
brew "eza"
brew "fd" unless ENV["HOMEBREW_CODESPACES"]
brew "fzf"
brew "gh" unless ENV["HOMEBREW_CODESPACES"]
brew "git" unless ENV["HOMEBREW_CODESPACES"]
brew "htop" unless ENV["HOMEBREW_CODESPACES"]
brew "kubernetes-cli" unless ENV["HOMEBREW_CODESPACES"]
brew "mas" if OS.mac?
brew "mise"
brew "neovim"
brew "nmap"
brew "parallel" unless ENV["HOMEBREW_CODESPACES"]
brew "ripgrep"
brew "sevenzip" unless ENV["HOMEBREW_CODESPACES"]
brew "thefuck" unless ENV["HOMEBREW_CODESPACES"]
brew "timg" unless ENV["HOMEBREW_CODESPACES"]
brew "tmux" if (OS.mac?) && !(ENV["HOMEBREW_CODESPACES"])
brew "tree"
brew "uv"
brew "viu" unless ENV["HOMEBREW_CODESPACES"]
brew "wakatime-cli" unless ENV["HOMEBREW_CODESPACES"]
brew "watch"
brew "wget" unless ENV["HOMEBREW_CODESPACES"]
brew "zsh" unless ENV["HOMEBREW_CODESPACES"]
cask "1password" if OS.mac?
cask "1password-cli" if OS.mac?
cask "alfred" if OS.mac?
cask "amethyst" if OS.mac?
cask "cursor" if OS.mac? && ENV["HOMEBREW_PRIVATE"]
cask "eqmac" if OS.mac?
cask "finicky" if OS.mac?
cask "font-fira-code-nerd-font" if OS.mac?
cask "font-symbols-only-nerd-font" if OS.mac?
cask "gcloud-cli" if OS.mac?
cask "ghostty" if OS.mac?
cask "iterm2" if OS.mac?
cask "jordanbaird-ice" if OS.mac?
cask "lookaway" if OS.mac?
cask "lulu" if OS.mac? && ENV["HOMEBREW_PRIVATE"]
cask "obsidian" if OS.mac?
cask "shadow" if OS.mac? && ENV["HOMEBREW_PRIVATE"]
cask "visual-studio-code" if OS.mac?
cask "wakatime" if OS.mac?
cask "xscreensaver" if OS.mac?
mas "Fantastical", id: 975937182 if OS.mac? && $stdin.tty?
mas "Irvue", id: 1039633667 if OS.mac? && $stdin.tty?
