age
ansible
argocd
argocd-vault-plugin
astro
autoconf
automake
aws-vault
awscli
bison
brotli
c-ares
ca-certificates
cairo
cffi
chezmoi
chruby
cilium-cli
cloudflared
direnv
docker-compose
docutils
exa
fish
flux
fontconfig
freetype
fzf
gdbm
gettext
giflib
git
gitleaks
gitops
glib
go
go-task
golangci-lint
gradle
graphite2
harfbuzz
helm
htop
hugo
icu4c
ipcalc
jpeg-turbo
jq
k9s
kubectx
kubernetes-cli
kustomize
libevent
libffi
libgit2
libidn2
liblinear
libnghttp2
libpng
libssh2
libtermkey
libtiff
libunistring
libuv
libvterm
libx11
libxau
libxcb
libxdmcp
libxext
libxrender
libyaml
little-cms2
lua
lua@5.3
luajit
luajit-openresty
luv
lz4
lzo
m4
mpdecimal
msgpack
ncurses
neovim
nmap
node
nvm
oniguruma
openjdk
openjdk@17
openssl@1.1
openssl@3
pcre
pcre2
pipenv
pixman
pkg-config
pre-commit
prettier
pycparser
pyenv
python-certifi
python-cryptography
python-lxml
python-markupsafe
python-packaging
python-pytz
python-setuptools
python@3.10
python@3.11
python@3.12
python@3.9
pyyaml
rancher-cli
readline
ruby
ruby-install
six
sops
sqlite
starship
stern
terraform
tflint
tmux
tree-sitter
unibilium
utf8proc
vault
virtualenv
watch
wget
xorgproto
xz
yamllint
yq
zsh
zstd
1password
1password-cli
adobe-acrobat-reader
alfred
brave-browser
discord
docker
dropbox
font-fira-code
font-fira-code-nerd-font
fork
iterm2
microsoft-auto-update
microsoft-office
microsoft-teams
miniconda
notion
obsidian
openlens
powershell
rectangle
royal-tsx
slack
spotify
stats
visual-studio-code
whatsapp
